# Задача 1. Написати програму, в якій необхідно видалити всі вказані літери з стрінги(string)
# Стрінгу(string) і літеру ввести з клавіатури
print('введіть якусь нерозривну послідовність літер')
Your_string = str(input())  # отримали "вхідна послідовність"
print('введіть літери яку треба прибрати з послідовності')
For_delete = str(input())  # отримали "зайве"
My_String = Your_string.replace(For_delete,"") #буквально: у "вхідна послідовність" замінити "зайве" на нічого
if My_String == Your_string:
    print('Схоже таких літер немає в вашій послідовності')
else:
    print('Ваша очищена стрінга виходить -->','`',My_String,'`')









