#Задача 3. Напишіть програму яка перевертає стрінгу
print('введіть якусь нерозривну послідовність!')
Your_string = str(input())  # отримали "вхідна послідовність"
print('Перегорнути Вам ваш рядок навпаки? y/n')
Choise_1 = (input())
if Choise_1 == 'n':
    print('тоді вашу послідовнітьс в тому ж виглялі',Your_string)
elif Choise_1 == 'y':
    reverso_string = Your_string[::-1]
    print('тоді ваша перегорнута послідовність виглядає так', reverso_string)
else:
    print('ви натиснули щось не те')