# Задача 2.Написати програму, яка знайде перше непослідовне число у списку
# Список задати у самій програмі у вигляді: list = [1, 5, 68, 0]
# У ньому може бути скільки завгодно елементів
# Наприклад, дано список [1,2,3,4,6,7,8]
# Відповіддю буде число 6. Якщо список послідовний, вивести відповідне повідомлення

numbers = [1, 2, 3, 4, 6, 7, 8, 9, 11, 12, 24]
for i in range(len(numbers) - 1):  # calculate the condition: difference between 2 near numbers as len
    if numbers[i + 1] - numbers[i] > 1:  # comparing a two range items
        print("Непослідовне значення в списку:", numbers[i + 1])
